# SQL Data Analysis Workshop

 This workshop is designed to help you build practical SQL skills by analyzing real-world business data. 
     
The tasks are divided into 4 levels to gradually progress from basic data retrieval to advanced analysis. Each level focuses on specific SQL concepts and challenges, allowing you to practice query writing, data filtering, aggregations, joins, and subqueries.
- Level 1: Basic SQL queries (SELECT, WHERE, ORDER BY, COUNT).
- Level 2: Aggregations (SUM, AVG, GROUP BY) and basic joins.
- Level 3: Complex joins, subqueries, and multi-table analysis.
- Level 4: Advanced analytical tasks focused on complex queries, subqueries, and aggregations..

This structured approach ensures you build confidence and expertise in SQL, preparing you for real-world data analysis challenges. ðŸš€

---
## Setup the work environment

#### 1. Library's import

In [7]:
import mysql.connector

#### 2. Connecting to the Database

In [9]:
db_connection = mysql.connector.connect(
    host="localhost",
    user="root",
    password="",
    database="mariamsbikes"
)
cursor = db_connection.cursor()
print("Connection established successfully.")

Connection established successfully.

#### 3. Setup for SQL Magic

In [11]:
%load_ext sql

In [13]:
%sql mysql+pymysql://root:@localhost/mariamsbikes

Connecting to 'mysql+pymysql://root:***@localhost/mariamsbikes'


---
## Level 1: Beginner â€“ Basic Queries (using SQL Magic)

### Task 1: Retrieve all rows and columns from the customers table.

In [15]:
%sql SELECT *FROM customers;

Running query in 'mysql+pymysql://root:***@localhost/mariamsbikes'

1445 rows affected.

+-------------+------------+-----------+----------------+----------------------------+-------------------------+-----------------+-------+----------+
| customer_id | first_name | last_name |     phone      |           email            |          street         |       city      | state | zip_code |
+-------------+------------+-----------+----------------+----------------------------+-------------------------+-----------------+-------+----------+
|      1      |   Debra    |   Burks   |      None      |   debra.burks@yahoo.com    |    9273 Thorne Ave.     |   Orchard Park  |   NY  |  14127   |
|      2      |   Kasha    |    Todd   |      None      |    kasha.todd@yahoo.com    |     910 Vine Street     |     Campbell    |   CA  |  95008   |
|      3      |   Tameka   |   Fisher  |      None      |   tameka.fisher@aol.com    |  769C Honey Creek St.   |  Redondo Beach  |   CA  |  90278   |
|      4      |   Daryl    |   Spence  |      None      |    daryl.spence@aol.com    |     988 Pearl Lane      |    Uniondale    |   NY  |  11553   |
|      5      | Charolette |    Rice   | (916) 381-6003 |  charolette.rice@msn.com   |      107 River Dr.      |    Sacramento   |   CA  |  95820   |
|      6      |  Lyndsey   |    Bean   |      None      |  lyndsey.bean@hotmail.com  |      769 West Road      |     Fairport    |   NY  |  14450   |
|      7      |  Latasha   |    Hays   | (716) 986-3359 |  latasha.hays@hotmail.com  | 7014 Manor Station Rd.  |     Buffalo     |   NY  |  14215   |
|      8      | Jacquline  |   Duncan  |      None      | jacquline.duncan@yahoo.com |      15 Brown St.       | Jackson Heights |   NY  |  11372   |
|      9      |  Genoveva  |  Baldwin  |      None      |  genoveva.baldwin@msn.com  |    8550 Spruce Drive    | Port Washington |   NY  |  11050   |
|      10     |  Pamelia   |   Newman  |      None      |  pamelia.newman@gmail.com  |    476 Chestnut Ave.    |      Monroe     |   NY  |  10950   |
+-------------+------------+-----------+----------------+----------------------------+-------------------------+-----------------+-------+----------+
Truncated to displaylimit of 10.

### Task 2: Retrieve customers who live in the city "New York".

In [17]:
%%sql SELECT customers.first_name , customers.city
FROM customers 
WHERE customers.city="New York"

Running query in 'mysql+pymysql://root:***@localhost/mariamsbikes'

7 rows affected.

+------------+----------+
| first_name |   city   |
+------------+----------+
|   Emmitt   | New York |
|  Genoveva  | New York |
|   Sharie   | New York |
|  Octavia   | New York |
|   Phylis   | New York |
| Guillermo  | New York |
|   Shenna   | New York |
+------------+----------+

### Task 3: Retrieve all products sorted by their price in descending order.

In [17]:
%%sql SELECT products.product_name, products.list_price
FROM products
ORDER BY products.list_price DESC

Running query in 'mysql+pymysql://root:***@localhost/mariamsbikes'

321 rows affected.

+----------------------------------------+------------+
|              product_name              | list_price |
+----------------------------------------+------------+
|     Trek Domane SLR 9 Disc - 2018      |  11999.99  |
|     Trek Domane SLR 8 Disc - 2018      |  7499.99   |
|    Trek Silque SLR 8 Women's - 2017    |  6499.99   |
|        Trek Emonda SLR 8 - 2018        |  6499.99   |
| Trek Domane SL Frameset Women's - 2018 |  6499.99   |
|     Trek Domane SL Frameset - 2018     |  6499.99   |
|    Trek Silque SLR 7 Women's - 2017    |  5999.99   |
|     Trek Domane SLR 6 Disc - 2018      |  5499.99   |
| Trek Domane SLR 6 Disc Women's - 2018  |  5499.99   |
|      Trek Domane SL 8 Disc - 2018      |  5499.99   |
+----------------------------------------+------------+
Truncated to displaylimit of 10.

### Task 4: Find Orders by Status

#### Task 4.1: Retrieve all orders with status "Completed".

In [19]:
%%sql SELECT orders.order_status, order_statuses.status_description
FROM orders JOIN order_statuses ON orders.order_status= order_statuses.status_id
WHERE order_statuses.status_description="completed";

Running query in 'mysql+pymysql://root:***@localhost/mariamsbikes'

1445 rows affected.

+--------------+--------------------+
| order_status | status_description |
+--------------+--------------------+
|      4       |     Completed      |
|      4       |     Completed      |
|      4       |     Completed      |
|      4       |     Completed      |
|      4       |     Completed      |
|      4       |     Completed      |
|      4       |     Completed      |
|      4       |     Completed      |
|      4       |     Completed      |
|      4       |     Completed      |
+--------------+--------------------+
Truncated to displaylimit of 10.

#### Task 4.1: Retrieve count of orders with status "Rejected".

In [42]:
%%sql SELECT order_statuses.status_description, COUNT(orders.order_status) AS Rejected_orders
FROM orders JOIN order_statuses ON orders.order_status= order_statuses.status_id
WHERE order_statuses.status_description="rejected";

Running query in 'mysql+pymysql://root:***@localhost/mariamsbikes'

1 rows affected.

+--------------------+-----------------+
| status_description | Rejected_orders |
+--------------------+-----------------+
|      Rejected      |        45       |
+--------------------+-----------------+

### Task 5: Count how many customers exist in the customers table.

In [44]:
%%sql SELECT COUNT(customers.customer_id) As number_of_customers
FROM customers

Running query in 'mysql+pymysql://root:***@localhost/mariamsbikes'

1 rows affected.

+---------------------+
| number_of_customers |
+---------------------+
|         1445        |
+---------------------+

---
## Level 2: Intermediate â€“ Aggregations and Basic Joins
##### (Task 1,2,3 using Pandas read_sql and Task 4,5 using execute and fetchall() in mysql.connector)

### Task 1: Calculate the total revenue (sum of list_price * quantity) from the order_items table.

In [21]:
%%sql SELECT SUM(order_items.list_price*order_items.quantity) AS Total_Revenue
FROM order_items

Running query in 'mysql+pymysql://root:***@localhost/mariamsbikes'

1 rows affected.

+---------------+
| Total_Revenue |
+---------------+
|   8578988.88  |
+---------------+

## Task 2: Calculate the average price of products in the products table.

In [23]:
%%sql SELECT AVG(products.list_price) AS Average_products_price
FROM products

Running query in 'mysql+pymysql://root:***@localhost/mariamsbikes'

1 rows affected.

+------------------------+
| Average_products_price |
+------------------------+
|      1520.591402       |
+------------------------+

Task 3: Retrieve the number of orders placed by each customer.

In [25]:
%%sql SELECT customer_id, COUNT(order_id) AS number_of_orders
FROM orders
GROUP BY customer_id;

Running query in 'mysql+pymysql://root:***@localhost/mariamsbikes'

1445 rows affected.

+-------------+------------------+
| customer_id | number_of_orders |
+-------------+------------------+
|      1      |        3         |
|      2      |        3         |
|      3      |        3         |
|      4      |        3         |
|      5      |        3         |
|      6      |        3         |
|      7      |        3         |
|      8      |        3         |
|      9      |        3         |
|      10     |        3         |
+-------------+------------------+
Truncated to displaylimit of 10.

### Task 4: Join Orders with Customers

#### Task 4.1: Retrieve customer names along with their order IDs.

In [27]:
%%sql SELECT customers.first_name, orders.order_id
FROM customers JOIN orders ON customers.customer_id = orders.customer_id;

Running query in 'mysql+pymysql://root:***@localhost/mariamsbikes'

1615 rows affected.

+------------+----------+
| first_name | order_id |
+------------+----------+
|   Debra    |   599    |
|   Debra    |   1555   |
|   Debra    |   1613   |
|   Kasha    |   692    |
|   Kasha    |   1084   |
|   Kasha    |   1509   |
|   Tameka   |   1468   |
|   Tameka   |   1496   |
|   Tameka   |   1612   |
|   Daryl    |   700    |
+------------+----------+
Truncated to displaylimit of 10.

#### Task 4.2: Retrieve Customer Names with Order IDs and Total Orders

In [29]:
%%sql SELECT customers.first_name,COUNT(orders.order_id) AS total_orders
FROM customers JOIN orders ON customers.customer_id=orders.customer_id
GROUP BY customers.first_name;

Running query in 'mysql+pymysql://root:***@localhost/mariamsbikes'

1265 rows affected.

+------------+--------------+
| first_name | total_orders |
+------------+--------------+
|   Aaron    |      1       |
|   Abbey    |      1       |
|    Abby    |      2       |
|   Abram    |      1       |
|    Adam    |      2       |
|   Addie    |      1       |
|  Adelaida  |      1       |
|   Adelle   |      2       |
|   Adena    |      1       |
|   Adrien   |      1       |
+------------+--------------+
Truncated to displaylimit of 10.

#Task 5: Retrieve products with stock quantities less than 50.

In [32]:
%%sql SELECT products.product_name, stocks.quantity
FROM products JOIN stocks ON products.product_id=stocks.product_id WHERE (stocks.quantity<50);

Running query in 'mysql+pymysql://root:***@localhost/mariamsbikes'

939 rows affected.

+------------------------------------+----------+
|            product_name            | quantity |
+------------------------------------+----------+
|          Trek 820 - 2016           |    27    |
|          Trek 820 - 2016           |    14    |
|          Trek 820 - 2016           |    14    |
| Ritchey Timberwolf Frameset - 2016 |    5     |
| Ritchey Timberwolf Frameset - 2016 |    16    |
| Ritchey Timberwolf Frameset - 2016 |    24    |
|  Surly Wednesday Frameset - 2016   |    6     |
|  Surly Wednesday Frameset - 2016   |    28    |
|  Surly Wednesday Frameset - 2016   |    0     |
|      Trek Fuel EX 8 29 - 2016      |    23    |
+------------------------------------+----------+
Truncated to displaylimit of 10.

---

## Level 3: Advanced â€“ Complex Joins and Subqueries
(using Pandas read_sql)

### Task 1: Retrieve the Top 5 Products with the Highest Total Sales Revenue

In [34]:
%%sql SELECT products.product_name,SUM(order_items.list_price*order_items.quantity) AS Total_revenue
FROM products JOIN order_items ON products.product_id=order_items.product_id
GROUP BY products.product_name
ORDER BY SUM(order_items.list_price) DESC 
LIMIT 5;

Running query in 'mysql+pymysql://root:***@localhost/mariamsbikes'

5 rows affected.

+-------------------------------+---------------+
|          product_name         | Total_revenue |
+-------------------------------+---------------+
|    Trek Slash 8 27.5 - 2016   |   615998.46   |
|      Trek Conduit+ - 2016     |   434998.55   |
|    Trek Fuel EX 8 29 - 2016   |   414698.57   |
|  Surly Straggler 650b - 2016  |   253829.49   |
| Trek Domane SLR 6 Disc - 2017 |   236499.57   |
+-------------------------------+---------------+

### Task 2: Find the Customers Who Placed the Most Orders in June, November 2018

In [38]:
%%sql SELECT customers.customer_id, customers.first_name,customers.last_name,COUNT(orders.order_id) AS TotalOrders
FROM customers JOIN orders ON customers.customer_id=orders.customer_id
WHERE orders.order_date BETWEEN '2018-06-01' AND '2018-06-30'
   OR orders.order_date BETWEEN '2018-11-01' AND '2018-11-30'
GROUP BY customers.customer_id, customers.first_name, customers.last_name;

Running query in 'mysql+pymysql://root:***@localhost/mariamsbikes'

3 rows affected.

+-------------+------------+-----------+-------------+
| customer_id | first_name | last_name | TotalOrders |
+-------------+------------+-----------+-------------+
|      1      |   Debra    |   Burks   |      1      |
|      7      |  Latasha   |    Hays   |      1      |
|     135     |  Dorthey   |  Jackson  |      1      |
+-------------+------------+-----------+-------------+

### Task 3: List All Stores with Their Total Stock Quantities for All Products

In [40]:
%%sql SELECT stores.store_name, SUM(stocks.quantity) AS totalStock
FROM stores JOIN stocks ON stores.store_id=stocks.store_id
GROUP BY stores.store_name, stores.store_id

Running query in 'mysql+pymysql://root:***@localhost/mariamsbikes'

3 rows affected.

+------------------+------------+
|    store_name    | totalStock |
+------------------+------------+
|  Baldwin Bikes   |    4359    |
|  Rowlett Bikes   |    4620    |
| Santa Cruz Bikes |    4532    |
+------------------+------------+

### Task 4: Retrieve Staff Members Who Work at Stores Located in a Specific State
California (CA) , New York (NY) , Texas (TX)

In [42]:
%%sql SELECT staffs.staff_id, staffs.first_name,staffs.last_name, stores.store_name, stores.state
FROM staffs JOIN stores ON staffs.store_id = stores.store_id WHERE stores.state = 'CA'

Running query in 'mysql+pymysql://root:***@localhost/mariamsbikes'

4 rows affected.

+----------+------------+-----------+------------------+-------+
| staff_id | first_name | last_name |    store_name    | state |
+----------+------------+-----------+------------------+-------+
|    1     |  Fabiola   |  Jackson  | Santa Cruz Bikes |   CA  |
|    2     |   Mireya   |  Copeland | Santa Cruz Bikes |   CA  |
|    3     |   Genna    |  Serrano  | Santa Cruz Bikes |   CA  |
|    4     |   Virgie   |  Wiggins  | Santa Cruz Bikes |   CA  |
+----------+------------+-----------+------------------+-------+

### Task 5: Identify the Categories of Products with the Highest Total Revenue

In [46]:
%%sql SELECT categories.category_name, SUM(order_items.list_price * order_items.quantity) AS total_revenue
FROM products JOIN order_items ON products.product_id = order_items.product_id JOIN categories ON products.category_id = categories.category_id
GROUP BY categories.category_name
ORDER BY total_revenue DESC
LIMIT 1;

Running query in 'mysql+pymysql://root:***@localhost/mariamsbikes'

1 rows affected.

+----------------+---------------+
| category_name  | total_revenue |
+----------------+---------------+
| Mountain Bikes |   3030775.71  |
+----------------+---------------+

---
## Level 4: Expert â€“ Advanced Analytical Queries
(using Pandas read_sql)

### Task 1: Find the Store with the Highest Total Revenue
Retrieve the store name and total revenue (sum of list_price * quantity) across all orders.

In [48]:
%%sql SELECT stores.store_name,SUM(order_items.list_price * order_items.quantity) AS total_revenue
FROM stores JOIN orders ON stores.store_id = orders.store_id JOIN order_items  ON orders.order_id = order_items.order_id
GROUP BY stores.store_name
ORDER BY total_revenue DESC
LIMIT 1;

Running query in 'mysql+pymysql://root:***@localhost/mariamsbikes'

1 rows affected.

+---------------+---------------+
|   store_name  | total_revenue |
+---------------+---------------+
| Baldwin Bikes |   5826242.21  |
+---------------+---------------+

### Task 2: Find all products that have never been ordered.

In [60]:
%%sql SELECT products.product_id, products.product_name
FROM order_items RIGHT JOIN products ON order_items.product_id = products.product_id WHERE order_items.product_id IS NULL;

Running query in 'mysql+pymysql://root:***@localhost/mariamsbikes'

14 rows affected.

+------------+------------------------------------------------+
| product_id |                  product_name                  |
+------------+------------------------------------------------+
|     1      |                Trek 820 - 2016                 |
|    121     |         Surly Krampus Frameset - 2018          |
|    125     |          Trek Kids' Dual Sport - 2018          |
|    154     |     Trek Domane SLR 6 Disc Women's - 2018      |
|    195     |      Electra Townie Go! 8i Ladies' - 2018      |
|    267     |        Trek Precaliber 12 Girl's - 2018        |
|    284     |  Electra Savannah 1 (20-inch) - Girl's - 2018  |
|    291     | Electra Sweet Ride 1 (20-inch) - Girl's - 2018 |
|    316     |      Trek Checkpoint ALR 4 Women's - 2019      |
|    317     |          Trek Checkpoint ALR 5 - 2019          |
+------------+------------------------------------------------+
Truncated to displaylimit of 10.

### Task 3: Identify the Customers Who Placed the Fewest Orders
Retrieve customer names and their total order counts, ordered in ascending order of order count.

In [62]:
%%sql SELECT customers.customer_id,customers.first_name,customers.last_name, COUNT(orders.order_id) AS total_orders
FROM customers LEFT JOIN orders ON customers.customer_id = orders.customer_id
GROUP BY customers.customer_id, customers.first_name,customers.last_name
ORDER BY total_orders, customers.customer_id ASC
LIMIT 5;

Running query in 'mysql+pymysql://root:***@localhost/mariamsbikes'

5 rows affected.

+-------------+------------+------------+--------------+
| customer_id | first_name | last_name  | total_orders |
+-------------+------------+------------+--------------+
|      95     |  Letitia   |   Franco   |      1       |
|      96     |  Floretta  |  Higgins   |      1       |
|      98     |   Violet   | Valenzuela |      1       |
|      99     |   Carie    |    Kidd    |      1       |
|     100     |   Kellie   |   Franco   |      1       |
+-------------+------------+------------+--------------+

### Task 4: Analyze Monthly Revenue for the Last Year (Specific to 2017)

In [64]:
%%sql SELECT MONTH(orders.order_date) AS month, SUM(order_items.list_price * order_items.quantity) AS monthly_revenue
FROM orders JOIN order_items ON orders.order_id = order_items.order_id WHERE orders.order_date BETWEEN '2017-01-01' AND '2017-12-31'
GROUP BY MONTH(orders.order_date)
ORDER BY month;

Running query in 'mysql+pymysql://root:***@localhost/mariamsbikes'

12 rows affected.

+-------+-----------------+
| month | monthly_revenue |
+-------+-----------------+
|   1   |    316954.77    |
|   2   |    348740.47    |
|   3   |    348177.13    |
|   4   |    254105.57    |
|   5   |    297754.66    |
|   6   |    419892.07    |
|   7   |    255727.63    |
|   8   |    322553.32    |
|   9   |    329388.68    |
|   10  |    345316.18    |
+-------+-----------------+
Truncated to displaylimit of 10.

### Task 5: Find Products That Are Low in Stock Across All Stores
Identify products where the total stock quantity (across all stores) is less than 100.

In [66]:
%%sql SELECT products.product_id, products.product_name, SUM(stocks.quantity) AS total_stock_quantity
FROM products JOIN stocks ON products.product_id = stocks.product_id
GROUP BY products.product_id, products.product_name
HAVING SUM(stocks.quantity) < 100;

Running query in 'mysql+pymysql://root:***@localhost/mariamsbikes'

313 rows affected.

+------------+---------------------------------------+----------------------+
| product_id |              product_name             | total_stock_quantity |
+------------+---------------------------------------+----------------------+
|     1      |            Trek 820 - 2016            |          55          |
|     2      |   Ritchey Timberwolf Frameset - 2016  |          45          |
|     3      |    Surly Wednesday Frameset - 2016    |          34          |
|     4      |        Trek Fuel EX 8 29 - 2016       |          36          |
|     5      |      Heller Shagamaw Frame - 2016     |          26          |
|     6      | Surly Ice Cream Truck Frameset - 2016 |          38          |
|     7      |        Trek Slash 8 27.5 - 2016       |          28          |
|     8      | Trek Remedy 29 Carbon Frameset - 2016 |          13          |
|     9      |          Trek Conduit+ - 2016         |          51          |
|     10     |         Surly Straggler - 2016        |          49          |
+------------+---------------------------------------+----------------------+
Truncated to displaylimit of 10.


---

## Level 5: Additional Advanced SQL
(using Pandas read_sql)

### Task 1: Aggregate Sales by City and State
Write a query to calculate the total sales, average order value, and maximum order value for customers in each city and state.

In [68]:
%%sql SELECT customers.city,customers.state,COUNT(customers.customer_id) AS customers_count, SUM(order_items.list_price * order_items.quantity) AS total_sales,AVG(order_items.list_price * order_items.quantity) AS avg_order_value, MAX(order_items.list_price * order_items.quantity) AS max_order_value
FROM customers JOIN orders ON customers.customer_id = orders.customer_id JOIN order_items ON orders.order_id = order_items.order_id
GROUP BY customers.city, customers.state
ORDER BY total_sales DESC;

Running query in 'mysql+pymysql://root:***@localhost/mariamsbikes'

195 rows affected.

+----------------+-------+-----------------+-------------+-----------------+-----------------+
|      city      | state | customers_count | total_sales | avg_order_value | max_order_value |
+----------------+-------+-----------------+-------------+-----------------+-----------------+
|  Mount Vernon  |   NY  |        60       |  117010.21  |   1950.170167   |     9999.98     |
|  Ballston Spa  |   NY  |        52       |  110065.34  |   2116.641154   |     11999.98    |
|   San Angelo   |   TX  |        53       |  109729.26  |   2070.363396   |     10999.98    |
| Baldwinsville  |   NY  |        37       |  105893.45  |   2861.985135   |     12999.98    |
|  Howard Beach  |   NY  |        36       |  104250.51  |   2895.847500   |     23999.98    |
|  Orchard Park  |   NY  |        48       |  101189.27  |   2108.109792   |     10999.98    |
| Canyon Country |   CA  |        44       |   96243.47  |   2187.351591   |     7999.98     |
|     Monroe     |   NY  |        44       |   93938.34  |   2134.962273   |     23999.98    |
|    Houston     |   TX  |        44       |   90449.47  |   2055.669773   |     9999.98     |
|    Astoria     |   NY  |        32       |   89650.56  |   2801.580000   |     12999.98    |
+----------------+-------+-----------------+-------------+-----------------+-----------------+
Truncated to displaylimit of 10.

### Task 2: Find Top-Selling Products in 2018
Write a query to identify the products with the highest sales volume in the year 2018.

In [70]:
%%sql SELECT products.product_id, YEAR(orders.order_date) AS order_year,products.product_name, SUM(order_items.quantity) AS total_unit_sold
FROM products JOIN order_items ON products.product_id = order_items.product_id JOIN orders ON order_items.order_id = orders.order_id WHERE orders.order_date BETWEEN '2018-01-01' AND '2018-12-31'
GROUP BY products.product_id, products.product_name
ORDER BY total_unit_sold DESC;

Running query in 'mysql+pymysql://root:***@localhost/mariamsbikes'

301 rows affected.

+------------+------------+-------------------------------------------+-----------------+
| product_id | order_year |                product_name               | total_unit_sold |
+------------+------------+-------------------------------------------+-----------------+
|     86     |    2018    |        Trek Girl's Kickster - 2017        |        12       |
|     92     |    2018    |          Haro Shredder 20 - 2017          |        11       |
|    263     |    2018    |   Strider Classic 12 Balance Bike - 2018  |        11       |
|    235     |    2018    |       Electra Koa 3i Ladies' - 2018       |        11       |
|    252     |    2018    | Electra Townie Commute Go! Ladies' - 2018 |        11       |
|    295     |    2018    |       Electra Treasure 1 20" - 2018       |        10       |
|     24     |    2018    |     Electra Townie Original 21D - 2016    |        10       |
|    230     |    2018    |    Electra Cruiser Lux 1 Ladies' - 2018   |        10       |
|    142     |    2018    |        Trek Fuel EX 8 29 XT - 2018        |        10       |
|     78     |    2018    |   Sun Bicycles Biscayne Tandem CB - 2017  |        10       |
+------------+------------+-------------------------------------------+-----------------+
Truncated to displaylimit of 10.

### Task 3: Calculate Month-over-Month Sales Growth
Write a query to calculate the month-over-month sales growth for the past years.

In [72]:
%%sql SELECT YEAR(orders.order_date) AS year, MONTH(orders.order_date) AS month, SUM(order_items.quantity) AS unit_sold, SUM(order_items.list_price * order_items.quantity) AS total_sales
FROM orders JOIN order_items ON orders.order_id = order_items.order_id 
GROUP BY YEAR(orders.order_date), MONTH(orders.order_date)
ORDER BY year, month;

Running query in 'mysql+pymysql://root:***@localhost/mariamsbikes'

35 rows affected.

+------+-------+-----------+-------------+
| year | month | unit_sold | total_sales |
+------+-------+-----------+-------------+
| 2016 |   1   |    221    |  241184.15  |
| 2016 |   2   |    223    |  175768.10  |
| 2016 |   3   |    213    |  202157.14  |
| 2016 |   4   |    176    |  187223.55  |
| 2016 |   5   |    224    |  228701.13  |
| 2016 |   6   |    199    |  231120.29  |
| 2016 |   7   |    211    |  222854.21  |
| 2016 |   8   |    251    |  253130.83  |
| 2016 |   9   |    281    |  303282.61  |
| 2016 |   10  |    254    |  235051.79  |
+------+-------+-----------+-------------+
Truncated to displaylimit of 10.